----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
             ReLU-10           [-1, 64, 56, 56]               0
       BasicBlock-11           [-1, 64, 56, 56]               0
           Conv2d-12           [-1, 64, 56, 56]          36,864
      BatchNorm2d-13           [-1, 64, 56, 56]             128
             ReLU-14           [-1, 64, 56, 56]               0
           Conv2d-15           [-1, 64, 56, 56]          36,864
      BatchNorm2d-16           [-1, 64, 56, 56]             128
             ReLU-17           [-1, 64, 56, 56]               0
       BasicBlock-18           [-1, 64, 56, 56]               0
           Conv2d-19          [-1, 128, 28, 28]          73,728
      BatchNorm2d-20          [-1, 128, 28, 28]             256
             ReLU-21          [-1, 128, 28, 28]               0
           Conv2d-22          [-1, 128, 28, 28]         147,456
      BatchNorm2d-23          [-1, 128, 28, 28]             256
           Conv2d-24          [-1, 128, 28, 28]           8,192
      BatchNorm2d-25          [-1, 128, 28, 28]             256
             ReLU-26          [-1, 128, 28, 28]               0
       BasicBlock-27          [-1, 128, 28, 28]               0
           Conv2d-28          [-1, 128, 28, 28]         147,456
      BatchNorm2d-29          [-1, 128, 28, 28]             256
             ReLU-30          [-1, 128, 28, 28]               0
           Conv2d-31          [-1, 128, 28, 28]         147,456
      BatchNorm2d-32          [-1, 128, 28, 28]             256
             ReLU-33          [-1, 128, 28, 28]               0
       BasicBlock-34          [-1, 128, 28, 28]               0
           Conv2d-35          [-1, 256, 14, 14]         294,912
      BatchNorm2d-36          [-1, 256, 14, 14]             512
             ReLU-37          [-1, 256, 14, 14]               0
           Conv2d-38          [-1, 256, 14, 14]         589,824
      BatchNorm2d-39          [-1, 256, 14, 14]             512
           Conv2d-40          [-1, 256, 14, 14]          32,768
      BatchNorm2d-41          [-1, 256, 14, 14]             512
             ReLU-42          [-1, 256, 14, 14]               0
       BasicBlock-43          [-1, 256, 14, 14]               0
           Conv2d-44          [-1, 256, 14, 14]         589,824
      BatchNorm2d-45          [-1, 256, 14, 14]             512
             ReLU-46          [-1, 256, 14, 14]               0
           Conv2d-47          [-1, 256, 14, 14]         589,824
      BatchNorm2d-48          [-1, 256, 14, 14]             512
             ReLU-49          [-1, 256, 14, 14]               0
       BasicBlock-50          [-1, 256, 14, 14]               0
           Conv2d-51            [-1, 512, 7, 7]       1,179,648
      BatchNorm2d-52            [-1, 512, 7, 7]           1,024
             ReLU-53            [-1, 512, 7, 7]               0
           Conv2d-54            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-55            [-1, 512, 7, 7]           1,024
           Conv2d-56            [-1, 512, 7, 7]         131,072
      BatchNorm2d-57            [-1, 512, 7, 7]           1,024
             ReLU-58            [-1, 512, 7, 7]               0
       BasicBlock-59            [-1, 512, 7, 7]               0
           Conv2d-60            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-61            [-1, 512, 7, 7]           1,024
             ReLU-62            [-1, 512, 7, 7]               0
           Conv2d-63            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-64            [-1, 512, 7, 7]           1,024
             ReLU-65            [-1, 512, 7, 7]               0
       BasicBlock-66            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-67            [-1, 512, 1, 1]               0
           Linear-68                 [-1, 1000]         513,000
================================================================
Total params: 11,689,512
Trainable params: 11,689,512
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 62.79
Params size (MB): 44.59
Estimated Total Size (MB): 107.96
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             864
       BatchNorm2d-2         [-1, 32, 112, 112]              64
             ReLU6-3         [-1, 32, 112, 112]               0
            Conv2d-4         [-1, 32, 112, 112]           1,024
       BatchNorm2d-5         [-1, 32, 112, 112]              64
             ReLU6-6         [-1, 32, 112, 112]               0
            Conv2d-7         [-1, 32, 112, 112]             288
       BatchNorm2d-8         [-1, 32, 112, 112]              64
             ReLU6-9         [-1, 32, 112, 112]               0
           Conv2d-10         [-1, 16, 112, 112]             512
      BatchNorm2d-11         [-1, 16, 112, 112]              32
DepthWiseSeparable-12         [-1, 16, 112, 112]               0
      MBConvBlock-13         [-1, 16, 112, 112]               0
           Conv2d-14         [-1, 96, 112, 112]           1,536
      BatchNorm2d-15         [-1, 96, 112, 112]             192
            ReLU6-16         [-1, 96, 112, 112]               0
           Conv2d-17           [-1, 96, 56, 56]             864
      BatchNorm2d-18           [-1, 96, 56, 56]             192
            ReLU6-19           [-1, 96, 56, 56]               0
           Conv2d-20           [-1, 24, 56, 56]           2,304
      BatchNorm2d-21           [-1, 24, 56, 56]              48
DepthWiseSeparable-22           [-1, 24, 56, 56]               0
      MBConvBlock-23           [-1, 24, 56, 56]               0
           Conv2d-24          [-1, 144, 56, 56]           3,456
      BatchNorm2d-25          [-1, 144, 56, 56]             288
            ReLU6-26          [-1, 144, 56, 56]               0
           Conv2d-27          [-1, 144, 56, 56]           1,296
      BatchNorm2d-28          [-1, 144, 56, 56]             288
            ReLU6-29          [-1, 144, 56, 56]               0
           Conv2d-30           [-1, 24, 56, 56]           3,456
      BatchNorm2d-31           [-1, 24, 56, 56]              48
DepthWiseSeparable-32           [-1, 24, 56, 56]               0
      MBConvBlock-33           [-1, 24, 56, 56]               0
           Conv2d-34          [-1, 144, 56, 56]           3,456
      BatchNorm2d-35          [-1, 144, 56, 56]             288
            ReLU6-36          [-1, 144, 56, 56]               0
           Conv2d-37          [-1, 144, 28, 28]           1,296
      BatchNorm2d-38          [-1, 144, 28, 28]             288
            ReLU6-39          [-1, 144, 28, 28]               0
           Conv2d-40           [-1, 32, 28, 28]           4,608
      BatchNorm2d-41           [-1, 32, 28, 28]              64
DepthWiseSeparable-42           [-1, 32, 28, 28]               0
      MBConvBlock-43           [-1, 32, 28, 28]               0
           Conv2d-44          [-1, 192, 28, 28]           6,144
      BatchNorm2d-45          [-1, 192, 28, 28]             384
            ReLU6-46          [-1, 192, 28, 28]               0
           Conv2d-47          [-1, 192, 28, 28]           1,728
      BatchNorm2d-48          [-1, 192, 28, 28]             384
            ReLU6-49          [-1, 192, 28, 28]               0
           Conv2d-50           [-1, 32, 28, 28]           6,144
      BatchNorm2d-51           [-1, 32, 28, 28]              64
DepthWiseSeparable-52           [-1, 32, 28, 28]               0
      MBConvBlock-53           [-1, 32, 28, 28]               0
           Conv2d-54          [-1, 192, 28, 28]           6,144
      BatchNorm2d-55          [-1, 192, 28, 28]             384
            ReLU6-56          [-1, 192, 28, 28]               0
           Conv2d-57          [-1, 192, 28, 28]           1,728
      BatchNorm2d-58          [-1, 192, 28, 28]             384
            ReLU6-59          [-1, 192, 28, 28]               0
           Conv2d-60           [-1, 32, 28, 28]           6,144
      BatchNorm2d-61           [-1, 32, 28, 28]              64
DepthWiseSeparable-62           [-1, 32, 28, 28]               0
      MBConvBlock-63           [-1, 32, 28, 28]               0
           Conv2d-64          [-1, 192, 28, 28]           6,144
      BatchNorm2d-65          [-1, 192, 28, 28]             384
            ReLU6-66          [-1, 192, 28, 28]               0
           Conv2d-67          [-1, 192, 14, 14]           1,728
      BatchNorm2d-68          [-1, 192, 14, 14]             384
            ReLU6-69          [-1, 192, 14, 14]               0
           Conv2d-70           [-1, 64, 14, 14]          12,288
      BatchNorm2d-71           [-1, 64, 14, 14]             128
DepthWiseSeparable-72           [-1, 64, 14, 14]               0
      MBConvBlock-73           [-1, 64, 14, 14]               0
           Conv2d-74          [-1, 384, 14, 14]          24,576
      BatchNorm2d-75          [-1, 384, 14, 14]             768
            ReLU6-76          [-1, 384, 14, 14]               0
           Conv2d-77          [-1, 384, 14, 14]           3,456
      BatchNorm2d-78          [-1, 384, 14, 14]             768
            ReLU6-79          [-1, 384, 14, 14]               0
           Conv2d-80           [-1, 64, 14, 14]          24,576
      BatchNorm2d-81           [-1, 64, 14, 14]             128
DepthWiseSeparable-82           [-1, 64, 14, 14]               0
      MBConvBlock-83           [-1, 64, 14, 14]               0
           Conv2d-84          [-1, 384, 14, 14]          24,576
      BatchNorm2d-85          [-1, 384, 14, 14]             768
            ReLU6-86          [-1, 384, 14, 14]               0
           Conv2d-87          [-1, 384, 14, 14]           3,456
      BatchNorm2d-88          [-1, 384, 14, 14]             768
            ReLU6-89          [-1, 384, 14, 14]               0
           Conv2d-90           [-1, 64, 14, 14]          24,576
      BatchNorm2d-91           [-1, 64, 14, 14]             128
DepthWiseSeparable-92           [-1, 64, 14, 14]               0
      MBConvBlock-93           [-1, 64, 14, 14]               0
           Conv2d-94          [-1, 384, 14, 14]          24,576
      BatchNorm2d-95          [-1, 384, 14, 14]             768
            ReLU6-96          [-1, 384, 14, 14]               0
           Conv2d-97          [-1, 384, 14, 14]           3,456
      BatchNorm2d-98          [-1, 384, 14, 14]             768
            ReLU6-99          [-1, 384, 14, 14]               0
          Conv2d-100           [-1, 64, 14, 14]          24,576
     BatchNorm2d-101           [-1, 64, 14, 14]             128
DepthWiseSeparable-102           [-1, 64, 14, 14]               0
     MBConvBlock-103           [-1, 64, 14, 14]               0
          Conv2d-104          [-1, 384, 14, 14]          24,576
     BatchNorm2d-105          [-1, 384, 14, 14]             768
           ReLU6-106          [-1, 384, 14, 14]               0
          Conv2d-107          [-1, 384, 14, 14]           3,456
     BatchNorm2d-108          [-1, 384, 14, 14]             768
           ReLU6-109          [-1, 384, 14, 14]               0
          Conv2d-110           [-1, 96, 14, 14]          36,864
     BatchNorm2d-111           [-1, 96, 14, 14]             192
DepthWiseSeparable-112           [-1, 96, 14, 14]               0
     MBConvBlock-113           [-1, 96, 14, 14]               0
          Conv2d-114          [-1, 576, 14, 14]          55,296
     BatchNorm2d-115          [-1, 576, 14, 14]           1,152
           ReLU6-116          [-1, 576, 14, 14]               0
          Conv2d-117          [-1, 576, 14, 14]           5,184
     BatchNorm2d-118          [-1, 576, 14, 14]           1,152
           ReLU6-119          [-1, 576, 14, 14]               0
          Conv2d-120           [-1, 96, 14, 14]          55,296
     BatchNorm2d-121           [-1, 96, 14, 14]             192
DepthWiseSeparable-122           [-1, 96, 14, 14]               0
     MBConvBlock-123           [-1, 96, 14, 14]               0
          Conv2d-124          [-1, 576, 14, 14]          55,296
     BatchNorm2d-125          [-1, 576, 14, 14]           1,152
           ReLU6-126          [-1, 576, 14, 14]               0
          Conv2d-127          [-1, 576, 14, 14]           5,184
     BatchNorm2d-128          [-1, 576, 14, 14]           1,152
           ReLU6-129          [-1, 576, 14, 14]               0
          Conv2d-130           [-1, 96, 14, 14]          55,296
     BatchNorm2d-131           [-1, 96, 14, 14]             192
DepthWiseSeparable-132           [-1, 96, 14, 14]               0
     MBConvBlock-133           [-1, 96, 14, 14]               0
          Conv2d-134          [-1, 576, 14, 14]          55,296
     BatchNorm2d-135          [-1, 576, 14, 14]           1,152
           ReLU6-136          [-1, 576, 14, 14]               0
          Conv2d-137            [-1, 576, 7, 7]           5,184
     BatchNorm2d-138            [-1, 576, 7, 7]           1,152
           ReLU6-139            [-1, 576, 7, 7]               0
          Conv2d-140            [-1, 160, 7, 7]          92,160
     BatchNorm2d-141            [-1, 160, 7, 7]             320
DepthWiseSeparable-142            [-1, 160, 7, 7]               0
     MBConvBlock-143            [-1, 160, 7, 7]               0
          Conv2d-144            [-1, 960, 7, 7]         153,600
     BatchNorm2d-145            [-1, 960, 7, 7]           1,920
           ReLU6-146            [-1, 960, 7, 7]               0
          Conv2d-147            [-1, 960, 7, 7]           8,640
     BatchNorm2d-148            [-1, 960, 7, 7]           1,920
           ReLU6-149            [-1, 960, 7, 7]               0
          Conv2d-150            [-1, 160, 7, 7]         153,600
     BatchNorm2d-151            [-1, 160, 7, 7]             320
DepthWiseSeparable-152            [-1, 160, 7, 7]               0
     MBConvBlock-153            [-1, 160, 7, 7]               0
          Conv2d-154            [-1, 960, 7, 7]         153,600
     BatchNorm2d-155            [-1, 960, 7, 7]           1,920
           ReLU6-156            [-1, 960, 7, 7]               0
          Conv2d-157            [-1, 960, 7, 7]           8,640
     BatchNorm2d-158            [-1, 960, 7, 7]           1,920
           ReLU6-159            [-1, 960, 7, 7]               0
          Conv2d-160            [-1, 160, 7, 7]         153,600
     BatchNorm2d-161            [-1, 160, 7, 7]             320
DepthWiseSeparable-162            [-1, 160, 7, 7]               0
     MBConvBlock-163            [-1, 160, 7, 7]               0
          Conv2d-164            [-1, 960, 7, 7]         153,600
     BatchNorm2d-165            [-1, 960, 7, 7]           1,920
           ReLU6-166            [-1, 960, 7, 7]               0
          Conv2d-167            [-1, 960, 7, 7]           8,640
     BatchNorm2d-168            [-1, 960, 7, 7]           1,920
           ReLU6-169            [-1, 960, 7, 7]               0
          Conv2d-170            [-1, 320, 7, 7]         307,200
     BatchNorm2d-171            [-1, 320, 7, 7]             640
DepthWiseSeparable-172            [-1, 320, 7, 7]               0
     MBConvBlock-173            [-1, 320, 7, 7]               0
          Conv2d-174           [-1, 1280, 7, 7]         409,600
     BatchNorm2d-175           [-1, 1280, 7, 7]           2,560
           ReLU6-176           [-1, 1280, 7, 7]               0
       AvgPool2d-177           [-1, 1280, 1, 1]               0
          Linear-178                 [-1, 1000]       1,281,000
================================================================
Total params: 3,505,960
Trainable params: 3,505,960
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 166.42
Params size (MB): 13.37
Estimated Total Size (MB): 180.37
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             864
       BatchNorm2d-2         [-1, 32, 112, 112]              64
             ReLU6-3         [-1, 32, 112, 112]               0
            Conv2d-4         [-1, 32, 112, 112]           1,024
       BatchNorm2d-5         [-1, 32, 112, 112]              64
             ReLU6-6         [-1, 32, 112, 112]               0
            Conv2d-7         [-1, 32, 112, 112]             288
       BatchNorm2d-8         [-1, 32, 112, 112]              64
             ReLU6-9         [-1, 32, 112, 112]               0
           Conv2d-10         [-1, 16, 112, 112]             512
      BatchNorm2d-11         [-1, 16, 112, 112]              32
DepthWiseSeparable-12         [-1, 16, 112, 112]               0
      MBConvBlock-13         [-1, 16, 112, 112]               0
           Conv2d-14         [-1, 96, 112, 112]           1,536
      BatchNorm2d-15         [-1, 96, 112, 112]             192
            ReLU6-16         [-1, 96, 112, 112]               0
           Conv2d-17           [-1, 96, 56, 56]             864
      BatchNorm2d-18           [-1, 96, 56, 56]             192
            ReLU6-19           [-1, 96, 56, 56]               0
           Conv2d-20           [-1, 24, 56, 56]           2,304
      BatchNorm2d-21           [-1, 24, 56, 56]              48
DepthWiseSeparable-22           [-1, 24, 56, 56]               0
      MBConvBlock-23           [-1, 24, 56, 56]               0
           Conv2d-24          [-1, 144, 56, 56]           3,456
      BatchNorm2d-25          [-1, 144, 56, 56]             288
            ReLU6-26          [-1, 144, 56, 56]               0
           Conv2d-27          [-1, 144, 56, 56]           1,296
      BatchNorm2d-28          [-1, 144, 56, 56]             288
            ReLU6-29          [-1, 144, 56, 56]               0
           Conv2d-30           [-1, 24, 56, 56]           3,456
      BatchNorm2d-31           [-1, 24, 56, 56]              48
DepthWiseSeparable-32           [-1, 24, 56, 56]               0
      MBConvBlock-33           [-1, 24, 56, 56]               0
           Conv2d-34          [-1, 144, 56, 56]           3,456
      BatchNorm2d-35          [-1, 144, 56, 56]             288
            ReLU6-36          [-1, 144, 56, 56]               0
           Conv2d-37          [-1, 144, 28, 28]           1,296
      BatchNorm2d-38          [-1, 144, 28, 28]             288
            ReLU6-39          [-1, 144, 28, 28]               0
           Conv2d-40           [-1, 40, 28, 28]           5,760
      BatchNorm2d-41           [-1, 40, 28, 28]              80
DepthWiseSeparable-42           [-1, 40, 28, 28]               0
      MBConvBlock-43           [-1, 40, 28, 28]               0
           Conv2d-44          [-1, 240, 28, 28]           9,600
      BatchNorm2d-45          [-1, 240, 28, 28]             480
            ReLU6-46          [-1, 240, 28, 28]               0
           Conv2d-47          [-1, 240, 28, 28]           6,000
      BatchNorm2d-48          [-1, 240, 28, 28]             480
            ReLU6-49          [-1, 240, 28, 28]               0
           Conv2d-50           [-1, 40, 28, 28]           9,600
      BatchNorm2d-51           [-1, 40, 28, 28]              80
DepthWiseSeparable-52           [-1, 40, 28, 28]               0
      MBConvBlock-53           [-1, 40, 28, 28]               0
           Conv2d-54          [-1, 240, 28, 28]           9,600
      BatchNorm2d-55          [-1, 240, 28, 28]             480
            ReLU6-56          [-1, 240, 28, 28]               0
           Conv2d-57          [-1, 240, 28, 28]           6,000
      BatchNorm2d-58          [-1, 240, 28, 28]             480
            ReLU6-59          [-1, 240, 28, 28]               0
           Conv2d-60           [-1, 40, 28, 28]           9,600
      BatchNorm2d-61           [-1, 40, 28, 28]              80
DepthWiseSeparable-62           [-1, 40, 28, 28]               0
      MBConvBlock-63           [-1, 40, 28, 28]               0
           Conv2d-64          [-1, 240, 28, 28]           9,600
      BatchNorm2d-65          [-1, 240, 28, 28]             480
            ReLU6-66          [-1, 240, 28, 28]               0
           Conv2d-67          [-1, 240, 14, 14]           2,160
      BatchNorm2d-68          [-1, 240, 14, 14]             480
            ReLU6-69          [-1, 240, 14, 14]               0
           Conv2d-70           [-1, 80, 14, 14]          19,200
      BatchNorm2d-71           [-1, 80, 14, 14]             160
DepthWiseSeparable-72           [-1, 80, 14, 14]               0
      MBConvBlock-73           [-1, 80, 14, 14]               0
           Conv2d-74          [-1, 480, 14, 14]          38,400
      BatchNorm2d-75          [-1, 480, 14, 14]             960
            ReLU6-76          [-1, 480, 14, 14]               0
           Conv2d-77          [-1, 480, 14, 14]           4,320
      BatchNorm2d-78          [-1, 480, 14, 14]             960
            ReLU6-79          [-1, 480, 14, 14]               0
           Conv2d-80           [-1, 80, 14, 14]          38,400
      BatchNorm2d-81           [-1, 80, 14, 14]             160
DepthWiseSeparable-82           [-1, 80, 14, 14]               0
      MBConvBlock-83           [-1, 80, 14, 14]               0
           Conv2d-84          [-1, 480, 14, 14]          38,400
      BatchNorm2d-85          [-1, 480, 14, 14]             960
            ReLU6-86          [-1, 480, 14, 14]               0
           Conv2d-87          [-1, 480, 14, 14]           4,320
      BatchNorm2d-88          [-1, 480, 14, 14]             960
            ReLU6-89          [-1, 480, 14, 14]               0
           Conv2d-90           [-1, 80, 14, 14]          38,400
      BatchNorm2d-91           [-1, 80, 14, 14]             160
DepthWiseSeparable-92           [-1, 80, 14, 14]               0
      MBConvBlock-93           [-1, 80, 14, 14]               0
           Conv2d-94          [-1, 480, 14, 14]          38,400
      BatchNorm2d-95          [-1, 480, 14, 14]             960
            ReLU6-96          [-1, 480, 14, 14]               0
           Conv2d-97          [-1, 480, 14, 14]           4,320
      BatchNorm2d-98          [-1, 480, 14, 14]             960
            ReLU6-99          [-1, 480, 14, 14]               0
          Conv2d-100           [-1, 80, 14, 14]          38,400
     BatchNorm2d-101           [-1, 80, 14, 14]             160
DepthWiseSeparable-102           [-1, 80, 14, 14]               0
     MBConvBlock-103           [-1, 80, 14, 14]               0
          Conv2d-104          [-1, 480, 14, 14]          38,400
     BatchNorm2d-105          [-1, 480, 14, 14]             960
           ReLU6-106          [-1, 480, 14, 14]               0
          Conv2d-107            [-1, 480, 7, 7]           4,320
     BatchNorm2d-108            [-1, 480, 7, 7]             960
           ReLU6-109            [-1, 480, 7, 7]               0
          Conv2d-110            [-1, 112, 7, 7]          53,760
     BatchNorm2d-111            [-1, 112, 7, 7]             224
DepthWiseSeparable-112            [-1, 112, 7, 7]               0
     MBConvBlock-113            [-1, 112, 7, 7]               0
          Conv2d-114            [-1, 672, 7, 7]          75,264
     BatchNorm2d-115            [-1, 672, 7, 7]           1,344
           ReLU6-116            [-1, 672, 7, 7]               0
          Conv2d-117            [-1, 672, 7, 7]          16,800
     BatchNorm2d-118            [-1, 672, 7, 7]           1,344
           ReLU6-119            [-1, 672, 7, 7]               0
          Conv2d-120            [-1, 112, 7, 7]          75,264
     BatchNorm2d-121            [-1, 112, 7, 7]             224
DepthWiseSeparable-122            [-1, 112, 7, 7]               0
     MBConvBlock-123            [-1, 112, 7, 7]               0
          Conv2d-124            [-1, 672, 7, 7]          75,264
     BatchNorm2d-125            [-1, 672, 7, 7]           1,344
           ReLU6-126            [-1, 672, 7, 7]               0
          Conv2d-127            [-1, 672, 7, 7]          16,800
     BatchNorm2d-128            [-1, 672, 7, 7]           1,344
           ReLU6-129            [-1, 672, 7, 7]               0
          Conv2d-130            [-1, 112, 7, 7]          75,264
     BatchNorm2d-131            [-1, 112, 7, 7]             224
DepthWiseSeparable-132            [-1, 112, 7, 7]               0
     MBConvBlock-133            [-1, 112, 7, 7]               0
          Conv2d-134            [-1, 672, 7, 7]          75,264
     BatchNorm2d-135            [-1, 672, 7, 7]           1,344
           ReLU6-136            [-1, 672, 7, 7]               0
          Conv2d-137            [-1, 672, 7, 7]          16,800
     BatchNorm2d-138            [-1, 672, 7, 7]           1,344
           ReLU6-139            [-1, 672, 7, 7]               0
          Conv2d-140            [-1, 192, 7, 7]         129,024
     BatchNorm2d-141            [-1, 192, 7, 7]             384
DepthWiseSeparable-142            [-1, 192, 7, 7]               0
     MBConvBlock-143            [-1, 192, 7, 7]               0
          Conv2d-144           [-1, 1152, 7, 7]         221,184
     BatchNorm2d-145           [-1, 1152, 7, 7]           2,304
           ReLU6-146           [-1, 1152, 7, 7]               0
          Conv2d-147           [-1, 1152, 7, 7]          28,800
     BatchNorm2d-148           [-1, 1152, 7, 7]           2,304
           ReLU6-149           [-1, 1152, 7, 7]               0
          Conv2d-150            [-1, 192, 7, 7]         221,184
     BatchNorm2d-151            [-1, 192, 7, 7]             384
DepthWiseSeparable-152            [-1, 192, 7, 7]               0
     MBConvBlock-153            [-1, 192, 7, 7]               0
          Conv2d-154           [-1, 1152, 7, 7]         221,184
     BatchNorm2d-155           [-1, 1152, 7, 7]           2,304
           ReLU6-156           [-1, 1152, 7, 7]               0
          Conv2d-157           [-1, 1152, 7, 7]          28,800
     BatchNorm2d-158           [-1, 1152, 7, 7]           2,304
           ReLU6-159           [-1, 1152, 7, 7]               0
          Conv2d-160            [-1, 192, 7, 7]         221,184
     BatchNorm2d-161            [-1, 192, 7, 7]             384
DepthWiseSeparable-162            [-1, 192, 7, 7]               0
     MBConvBlock-163            [-1, 192, 7, 7]               0
          Conv2d-164           [-1, 1152, 7, 7]         221,184
     BatchNorm2d-165           [-1, 1152, 7, 7]           2,304
           ReLU6-166           [-1, 1152, 7, 7]               0
          Conv2d-167           [-1, 1152, 7, 7]          10,368
     BatchNorm2d-168           [-1, 1152, 7, 7]           2,304
           ReLU6-169           [-1, 1152, 7, 7]               0
          Conv2d-170            [-1, 320, 7, 7]         368,640
     BatchNorm2d-171            [-1, 320, 7, 7]             640
DepthWiseSeparable-172            [-1, 320, 7, 7]               0
     MBConvBlock-173            [-1, 320, 7, 7]               0
          Conv2d-174           [-1, 1280, 7, 7]         409,600
     BatchNorm2d-175           [-1, 1280, 7, 7]           2,560
           ReLU6-176           [-1, 1280, 7, 7]               0
       AvgPool2d-177           [-1, 1280, 1, 1]               0
          Linear-178                 [-1, 1000]       1,281,000
================================================================
Total params: 4,276,392
Trainable params: 4,276,392
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 164.90
Params size (MB): 16.31
Estimated Total Size (MB): 181.79
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             864
       BatchNorm2d-2         [-1, 32, 112, 112]              64
              SiLU-3         [-1, 32, 112, 112]               0
            Conv2d-4         [-1, 32, 112, 112]             288
       BatchNorm2d-5         [-1, 32, 112, 112]              64
              SiLU-6         [-1, 32, 112, 112]               0
 AdaptiveAvgPool2d-7             [-1, 32, 1, 1]               0
            Conv2d-8              [-1, 8, 1, 1]             264
              SiLU-9              [-1, 8, 1, 1]               0
           Conv2d-10             [-1, 32, 1, 1]             288
          Sigmoid-11             [-1, 32, 1, 1]               0
SqueezeExcitation-12         [-1, 32, 112, 112]               0
           Conv2d-13         [-1, 16, 112, 112]             512
      BatchNorm2d-14         [-1, 16, 112, 112]              32
           MBConv-15         [-1, 16, 112, 112]               0
           Conv2d-16         [-1, 96, 112, 112]           1,536
      BatchNorm2d-17         [-1, 96, 112, 112]             192
             SiLU-18         [-1, 96, 112, 112]               0
           Conv2d-19           [-1, 96, 56, 56]             864
      BatchNorm2d-20           [-1, 96, 56, 56]             192
             SiLU-21           [-1, 96, 56, 56]               0
AdaptiveAvgPool2d-22             [-1, 96, 1, 1]               0
           Conv2d-23              [-1, 4, 1, 1]             388
             SiLU-24              [-1, 4, 1, 1]               0
           Conv2d-25             [-1, 96, 1, 1]             480
          Sigmoid-26             [-1, 96, 1, 1]               0
SqueezeExcitation-27           [-1, 96, 56, 56]               0
           Conv2d-28           [-1, 24, 56, 56]           2,304
      BatchNorm2d-29           [-1, 24, 56, 56]              48
           MBConv-30           [-1, 24, 56, 56]               0
           Conv2d-31          [-1, 144, 56, 56]           3,456
      BatchNorm2d-32          [-1, 144, 56, 56]             288
             SiLU-33          [-1, 144, 56, 56]               0
           Conv2d-34          [-1, 144, 56, 56]           1,296
      BatchNorm2d-35          [-1, 144, 56, 56]             288
             SiLU-36          [-1, 144, 56, 56]               0
AdaptiveAvgPool2d-37            [-1, 144, 1, 1]               0
           Conv2d-38              [-1, 6, 1, 1]             870
             SiLU-39              [-1, 6, 1, 1]               0
           Conv2d-40            [-1, 144, 1, 1]           1,008
          Sigmoid-41            [-1, 144, 1, 1]               0
SqueezeExcitation-42          [-1, 144, 56, 56]               0
           Conv2d-43           [-1, 24, 56, 56]           3,456
      BatchNorm2d-44           [-1, 24, 56, 56]              48
  StochasticDepth-45           [-1, 24, 56, 56]               0
           MBConv-46           [-1, 24, 56, 56]               0
           Conv2d-47          [-1, 144, 56, 56]           3,456
      BatchNorm2d-48          [-1, 144, 56, 56]             288
             SiLU-49          [-1, 144, 56, 56]               0
           Conv2d-50          [-1, 144, 28, 28]           3,600
      BatchNorm2d-51          [-1, 144, 28, 28]             288
             SiLU-52          [-1, 144, 28, 28]               0
AdaptiveAvgPool2d-53            [-1, 144, 1, 1]               0
           Conv2d-54              [-1, 6, 1, 1]             870
             SiLU-55              [-1, 6, 1, 1]               0
           Conv2d-56            [-1, 144, 1, 1]           1,008
          Sigmoid-57            [-1, 144, 1, 1]               0
SqueezeExcitation-58          [-1, 144, 28, 28]               0
           Conv2d-59           [-1, 40, 28, 28]           5,760
      BatchNorm2d-60           [-1, 40, 28, 28]              80
           MBConv-61           [-1, 40, 28, 28]               0
           Conv2d-62          [-1, 240, 28, 28]           9,600
      BatchNorm2d-63          [-1, 240, 28, 28]             480
             SiLU-64          [-1, 240, 28, 28]               0
           Conv2d-65          [-1, 240, 28, 28]           6,000
      BatchNorm2d-66          [-1, 240, 28, 28]             480
             SiLU-67          [-1, 240, 28, 28]               0
AdaptiveAvgPool2d-68            [-1, 240, 1, 1]               0
           Conv2d-69             [-1, 10, 1, 1]           2,410
             SiLU-70             [-1, 10, 1, 1]               0
           Conv2d-71            [-1, 240, 1, 1]           2,640
          Sigmoid-72            [-1, 240, 1, 1]               0
SqueezeExcitation-73          [-1, 240, 28, 28]               0
           Conv2d-74           [-1, 40, 28, 28]           9,600
      BatchNorm2d-75           [-1, 40, 28, 28]              80
  StochasticDepth-76           [-1, 40, 28, 28]               0
           MBConv-77           [-1, 40, 28, 28]               0
           Conv2d-78          [-1, 240, 28, 28]           9,600
      BatchNorm2d-79          [-1, 240, 28, 28]             480
             SiLU-80          [-1, 240, 28, 28]               0
           Conv2d-81          [-1, 240, 14, 14]           2,160
      BatchNorm2d-82          [-1, 240, 14, 14]             480
             SiLU-83          [-1, 240, 14, 14]               0
AdaptiveAvgPool2d-84            [-1, 240, 1, 1]               0
           Conv2d-85             [-1, 10, 1, 1]           2,410
             SiLU-86             [-1, 10, 1, 1]               0
           Conv2d-87            [-1, 240, 1, 1]           2,640
          Sigmoid-88            [-1, 240, 1, 1]               0
SqueezeExcitation-89          [-1, 240, 14, 14]               0
           Conv2d-90           [-1, 80, 14, 14]          19,200
      BatchNorm2d-91           [-1, 80, 14, 14]             160
           MBConv-92           [-1, 80, 14, 14]               0
           Conv2d-93          [-1, 480, 14, 14]          38,400
      BatchNorm2d-94          [-1, 480, 14, 14]             960
             SiLU-95          [-1, 480, 14, 14]               0
           Conv2d-96          [-1, 480, 14, 14]           4,320
      BatchNorm2d-97          [-1, 480, 14, 14]             960
             SiLU-98          [-1, 480, 14, 14]               0
AdaptiveAvgPool2d-99            [-1, 480, 1, 1]               0
          Conv2d-100             [-1, 20, 1, 1]           9,620
            SiLU-101             [-1, 20, 1, 1]               0
          Conv2d-102            [-1, 480, 1, 1]          10,080
         Sigmoid-103            [-1, 480, 1, 1]               0
SqueezeExcitation-104          [-1, 480, 14, 14]               0
          Conv2d-105           [-1, 80, 14, 14]          38,400
     BatchNorm2d-106           [-1, 80, 14, 14]             160
 StochasticDepth-107           [-1, 80, 14, 14]               0
          MBConv-108           [-1, 80, 14, 14]               0
          Conv2d-109          [-1, 480, 14, 14]          38,400
     BatchNorm2d-110          [-1, 480, 14, 14]             960
            SiLU-111          [-1, 480, 14, 14]               0
          Conv2d-112          [-1, 480, 14, 14]           4,320
     BatchNorm2d-113          [-1, 480, 14, 14]             960
            SiLU-114          [-1, 480, 14, 14]               0
AdaptiveAvgPool2d-115            [-1, 480, 1, 1]               0
          Conv2d-116             [-1, 20, 1, 1]           9,620
            SiLU-117             [-1, 20, 1, 1]               0
          Conv2d-118            [-1, 480, 1, 1]          10,080
         Sigmoid-119            [-1, 480, 1, 1]               0
SqueezeExcitation-120          [-1, 480, 14, 14]               0
          Conv2d-121           [-1, 80, 14, 14]          38,400
     BatchNorm2d-122           [-1, 80, 14, 14]             160
 StochasticDepth-123           [-1, 80, 14, 14]               0
          MBConv-124           [-1, 80, 14, 14]               0
          Conv2d-125          [-1, 480, 14, 14]          38,400
     BatchNorm2d-126          [-1, 480, 14, 14]             960
            SiLU-127          [-1, 480, 14, 14]               0
          Conv2d-128          [-1, 480, 14, 14]          12,000
     BatchNorm2d-129          [-1, 480, 14, 14]             960
            SiLU-130          [-1, 480, 14, 14]               0
AdaptiveAvgPool2d-131            [-1, 480, 1, 1]               0
          Conv2d-132             [-1, 20, 1, 1]           9,620
            SiLU-133             [-1, 20, 1, 1]               0
          Conv2d-134            [-1, 480, 1, 1]          10,080
         Sigmoid-135            [-1, 480, 1, 1]               0
SqueezeExcitation-136          [-1, 480, 14, 14]               0
          Conv2d-137          [-1, 112, 14, 14]          53,760
     BatchNorm2d-138          [-1, 112, 14, 14]             224
          MBConv-139          [-1, 112, 14, 14]               0
          Conv2d-140          [-1, 672, 14, 14]          75,264
     BatchNorm2d-141          [-1, 672, 14, 14]           1,344
            SiLU-142          [-1, 672, 14, 14]               0
          Conv2d-143          [-1, 672, 14, 14]          16,800
     BatchNorm2d-144          [-1, 672, 14, 14]           1,344
            SiLU-145          [-1, 672, 14, 14]               0
AdaptiveAvgPool2d-146            [-1, 672, 1, 1]               0
          Conv2d-147             [-1, 28, 1, 1]          18,844
            SiLU-148             [-1, 28, 1, 1]               0
          Conv2d-149            [-1, 672, 1, 1]          19,488
         Sigmoid-150            [-1, 672, 1, 1]               0
SqueezeExcitation-151          [-1, 672, 14, 14]               0
          Conv2d-152          [-1, 112, 14, 14]          75,264
     BatchNorm2d-153          [-1, 112, 14, 14]             224
 StochasticDepth-154          [-1, 112, 14, 14]               0
          MBConv-155          [-1, 112, 14, 14]               0
          Conv2d-156          [-1, 672, 14, 14]          75,264
     BatchNorm2d-157          [-1, 672, 14, 14]           1,344
            SiLU-158          [-1, 672, 14, 14]               0
          Conv2d-159          [-1, 672, 14, 14]          16,800
     BatchNorm2d-160          [-1, 672, 14, 14]           1,344
            SiLU-161          [-1, 672, 14, 14]               0
AdaptiveAvgPool2d-162            [-1, 672, 1, 1]               0
          Conv2d-163             [-1, 28, 1, 1]          18,844
            SiLU-164             [-1, 28, 1, 1]               0
          Conv2d-165            [-1, 672, 1, 1]          19,488
         Sigmoid-166            [-1, 672, 1, 1]               0
SqueezeExcitation-167          [-1, 672, 14, 14]               0
          Conv2d-168          [-1, 112, 14, 14]          75,264
     BatchNorm2d-169          [-1, 112, 14, 14]             224
 StochasticDepth-170          [-1, 112, 14, 14]               0
          MBConv-171          [-1, 112, 14, 14]               0
          Conv2d-172          [-1, 672, 14, 14]          75,264
     BatchNorm2d-173          [-1, 672, 14, 14]           1,344
            SiLU-174          [-1, 672, 14, 14]               0
          Conv2d-175            [-1, 672, 7, 7]          16,800
     BatchNorm2d-176            [-1, 672, 7, 7]           1,344
            SiLU-177            [-1, 672, 7, 7]               0
AdaptiveAvgPool2d-178            [-1, 672, 1, 1]               0
          Conv2d-179             [-1, 28, 1, 1]          18,844
            SiLU-180             [-1, 28, 1, 1]               0
          Conv2d-181            [-1, 672, 1, 1]          19,488
         Sigmoid-182            [-1, 672, 1, 1]               0
SqueezeExcitation-183            [-1, 672, 7, 7]               0
          Conv2d-184            [-1, 192, 7, 7]         129,024
     BatchNorm2d-185            [-1, 192, 7, 7]             384
          MBConv-186            [-1, 192, 7, 7]               0
          Conv2d-187           [-1, 1152, 7, 7]         221,184
     BatchNorm2d-188           [-1, 1152, 7, 7]           2,304
            SiLU-189           [-1, 1152, 7, 7]               0
          Conv2d-190           [-1, 1152, 7, 7]          28,800
     BatchNorm2d-191           [-1, 1152, 7, 7]           2,304
            SiLU-192           [-1, 1152, 7, 7]               0
AdaptiveAvgPool2d-193           [-1, 1152, 1, 1]               0
          Conv2d-194             [-1, 48, 1, 1]          55,344
            SiLU-195             [-1, 48, 1, 1]               0
          Conv2d-196           [-1, 1152, 1, 1]          56,448
         Sigmoid-197           [-1, 1152, 1, 1]               0
SqueezeExcitation-198           [-1, 1152, 7, 7]               0
          Conv2d-199            [-1, 192, 7, 7]         221,184
     BatchNorm2d-200            [-1, 192, 7, 7]             384
 StochasticDepth-201            [-1, 192, 7, 7]               0
          MBConv-202            [-1, 192, 7, 7]               0
          Conv2d-203           [-1, 1152, 7, 7]         221,184
     BatchNorm2d-204           [-1, 1152, 7, 7]           2,304
            SiLU-205           [-1, 1152, 7, 7]               0
          Conv2d-206           [-1, 1152, 7, 7]          28,800
     BatchNorm2d-207           [-1, 1152, 7, 7]           2,304
            SiLU-208           [-1, 1152, 7, 7]               0
AdaptiveAvgPool2d-209           [-1, 1152, 1, 1]               0
          Conv2d-210             [-1, 48, 1, 1]          55,344
            SiLU-211             [-1, 48, 1, 1]               0
          Conv2d-212           [-1, 1152, 1, 1]          56,448
         Sigmoid-213           [-1, 1152, 1, 1]               0
SqueezeExcitation-214           [-1, 1152, 7, 7]               0
          Conv2d-215            [-1, 192, 7, 7]         221,184
     BatchNorm2d-216            [-1, 192, 7, 7]             384
 StochasticDepth-217            [-1, 192, 7, 7]               0
          MBConv-218            [-1, 192, 7, 7]               0
          Conv2d-219           [-1, 1152, 7, 7]         221,184
     BatchNorm2d-220           [-1, 1152, 7, 7]           2,304
            SiLU-221           [-1, 1152, 7, 7]               0
          Conv2d-222           [-1, 1152, 7, 7]          28,800
     BatchNorm2d-223           [-1, 1152, 7, 7]           2,304
            SiLU-224           [-1, 1152, 7, 7]               0
AdaptiveAvgPool2d-225           [-1, 1152, 1, 1]               0
          Conv2d-226             [-1, 48, 1, 1]          55,344
            SiLU-227             [-1, 48, 1, 1]               0
          Conv2d-228           [-1, 1152, 1, 1]          56,448
         Sigmoid-229           [-1, 1152, 1, 1]               0
SqueezeExcitation-230           [-1, 1152, 7, 7]               0
          Conv2d-231            [-1, 192, 7, 7]         221,184
     BatchNorm2d-232            [-1, 192, 7, 7]             384
 StochasticDepth-233            [-1, 192, 7, 7]               0
          MBConv-234            [-1, 192, 7, 7]               0
          Conv2d-235           [-1, 1152, 7, 7]         221,184
     BatchNorm2d-236           [-1, 1152, 7, 7]           2,304
            SiLU-237           [-1, 1152, 7, 7]               0
          Conv2d-238           [-1, 1152, 7, 7]          10,368
     BatchNorm2d-239           [-1, 1152, 7, 7]           2,304
            SiLU-240           [-1, 1152, 7, 7]               0
AdaptiveAvgPool2d-241           [-1, 1152, 1, 1]               0
          Conv2d-242             [-1, 48, 1, 1]          55,344
            SiLU-243             [-1, 48, 1, 1]               0
          Conv2d-244           [-1, 1152, 1, 1]          56,448
         Sigmoid-245           [-1, 1152, 1, 1]               0
SqueezeExcitation-246           [-1, 1152, 7, 7]               0
          Conv2d-247            [-1, 320, 7, 7]         368,640
     BatchNorm2d-248            [-1, 320, 7, 7]             640
          MBConv-249            [-1, 320, 7, 7]               0
          Conv2d-250           [-1, 1280, 7, 7]         409,600
     BatchNorm2d-251           [-1, 1280, 7, 7]           2,560
            SiLU-252           [-1, 1280, 7, 7]               0
AdaptiveAvgPool2d-253           [-1, 1280, 1, 1]               0
         Dropout-254                 [-1, 1280]               0
          Linear-255                 [-1, 1000]       1,281,000
================================================================
Total params: 5,288,548
Trainable params: 5,288,548
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 173.65
Params size (MB): 20.17
Estimated Total Size (MB): 194.40
----------------------------------------------------------------
